value = 2 + 3
value
""" запускаем и ничего не выводится, это получилось из-за того, что интерпретатор напрямую транслирует все операции
в среде разработки нужно давать более детальные инструкции по выводу """
# print(value)


""""""""""""""""""""""""""""""""""""""
""" PEP8 - ПРАВИЛА ОФОРМЛЕНИЯ КОДА """
""""""""""""""""""""""""""""""""""""""
#  double shift → reformat code (ctrl + alt + l)
value=2+3


""""""""""""""""""""""""""
""" ИНТЕРПРЕТИРУЕМОСТЬ """
""""""""""""""""""""""""""
# print('Program started')
# a = 1
# b = 2
# c = b / a
# print(c)


""""""""""""""""""""""""""""""
""" ДИНАМИЧЕСКАЯ ТИПИЗАЦИЯ """
""""""""""""""""""""""""""""""
# a = 1
# b = 2
# print('Было', a, b)
# a = 'one'
# b = 'two'
# print('Стало', a, b)


""""""""""""""""""""""""""""""
""" ВСТРОЕННЫЕ ТИПЫ ДАННЫХ """
""""""""""""""""""""""""""""""
# a = 1.3
# print(a, 'is', type(a))
# a = 'string'
# print(a, 'is', type(a))
# a = True
# print(a, 'is', type(a))
# a = [1, 'str', 3.5, [True, False]]
# print(a, 'is', type(a))
# a = (1, 2, 'g')
# print(a, 'is', type(a))
# a = {'name': 'Anna', 'age': '18'}
# print(a, 'is', type(a))


""""""""""""""""""""""""""""""
""" АРИФМЕТИЧЕСКИЕ ОПЕРАЦИИ"""
"""  +, -, *, /, //, %, ** """
""""""""""""""""""""""""""""""


""""""""""""""""""""""""""""""""""""
"""     ЛОГИЧЕСКИЕ ОПЕРАЦИИ      """
""" >, >=, <, <=, ==, !=, and, or"""
""""""""""""""""""""""""""""""""""""
